In [4]:
import pandas as pd
import numpy as np
import statsmodels.api as sm
import statsmodels.formula.api as smf

In [2]:
df = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-a-tutov/dating_data.csv')

In [3]:
df

       user_id_1  user_id_2  group  is_match
0             79         91      1         1
1            716        353      1         1
2            423        677      0         0
3            658        165      1         1
4            969        155      0         1
...          ...        ...    ...       ...
14509        476        631      0         0
14510        455        770      1         0
14511        260          6      1         1
14512        885        812      1         1
14513        357        810      1         1

[14514 rows x 4 columns]

In [14]:
### ВЫБЕРЕМ ДАННЫЕ ИЗ КАЖДОЙ ГРУППЫ

In [12]:
group0 = df.query("group == '0'")
group0

       user_id_1  user_id_2  group  is_match
2            423        677      0         0
4            969        155      0         1
5            227        162      0         0
8            223        295      0         0
10           825        388      0         0
...          ...        ...    ...       ...
14502        535        545      0         0
14503        128        268      0         0
14505        544        600      0         0
14506        903        505      0         0
14509        476        631      0         0

[4792 rows x 4 columns]

In [13]:
group1 = df.query("group == '1'")
group1

       user_id_1  user_id_2  group  is_match
0             79         91      1         1
1            716        353      1         1
3            658        165      1         1
6            435         16      1         0
7            602        327      1         0
...          ...        ...    ...       ...
14508        527        647      1         0
14510        455        770      1         0
14511        260          6      1         1
14512        885        812      1         1
14513        357        810      1         1

[9722 rows x 4 columns]

In [15]:
### ПОСЧИТАЕМ КОЛИЧЕСТВО И ДОЛЮ МЭТЧЕЙ В ГРУППАХ

In [20]:
match0 = group0.is_match.sum()
match0

934

In [26]:
match1 = group1.is_match.sum()
match1

3909

In [32]:
l0 = len(group0)
match0_rate = match0/l0
round(match0_rate, 3)

0.195

In [33]:
l1 = len(group1)
match1_rate = match1/l1
round(match1_rate, 3)

0.402

In [34]:
### Доля мэтчей в группе с новым алгоритмом оказалась больше

In [51]:
### ПРоведем З-тест (https://www.statsmodels.org/dev/generated/statsmodels.stats.proportion.proportions_ztest.html)

In [37]:
from statsmodels.stats.proportion import proportions_ztest

In [40]:
count = np.array([match0, match1])
count

array([ 934, 3909])

In [44]:
nobs = np.array([l0, l1])
nobs

array([4792, 9722])

In [54]:
zstat, pval = proportions_ztest(count, nobs)

In [55]:
zstat

-24.89217439232899

In [56]:
pval # слишком маленькое значение

9.0433754456208e-137

In [57]:
### ВЫВОД

In [58]:
if pval < 0.05:
    print('стоит включать новую систему поиска анкет на всех пользователей')
else:
    print('не стоит включать новую систему поиска анкет на всех пользователей')

стоит включать новую систему поиска анкет на всех пользователей

In [60]:
### таким образом, различие между группами статистически значимо

In [61]:
### upd: графики решил не делать, т.к. тут особо интересного выводить нечего, кроме как количество пользователей или мэчей